
DESCRIPTION = {
	'summary': '종목 실시간 체결강도 8081',
	'point': '''
	  8081, 8082,8083이 유사해서, 사용을 위해그 차이 정도를  숙지 
  - 8081 요청하는 종목 실시간 체결강도 데이티를 받아오는 것에 특화로 보임.  
    특이한 것은 최근 *일 간의 체결강도 순위와 *거래량 기준 단위별로 데이터를 요청가능.  
    그리고 유용해보이는 하락률 큰 순의 요청도 가능하다는 것이다.(하락율순이 가격인지 체결강도 자체의 감소인지 확인필요)
       
  
          통신방식        연속여부  특성
  - 8081 Request/Reply    o   종목별 (실시간) 체결강도 
    8082 Request/Reply    x   종목별/업종별 일별 체결강도 
    8083 Request/Reply    x   종목별/업종별 시간대별 체결강도 (최대 360분) 

	통신종류 
 		Request/Reply
 
CpSvr8081.SetInputValue(type,value)
  type: 입력 데이터 종류
0 - (string)  종목/업종/선물 
1 - (char)  최근분수 구분 
  '0' 시장구분  1전체, 2거래소,3코스닥
  '1' 정렬구분 1.당일 2.5일 3.50(?확인필요), 4.60, 5.하락율큰순 
  '2' 거개량구분 1.전체, 2.1만, 3.5만, 4.10만, 5.50만, 6.100만(이상)
 
value = CpSvr8081.GetHeaderValue(type)
type: 데이터 종류
  0 - (short) 수신개수

value = CpSvr8081.GetDataValue (Type,index)
  type: 데이터 종류
0 - (string) 종목코드
1 - (string) 종목명
2 - (long) 전일대비
3 - (float) 전일대비율
4 - (long) 현재가
5 - (long) 거래량
6 - (float) 체결강도(%) 1일
7 - (float) 체결강도(%) 5일
8 - (float) 체결강도(%) 20일
9 - (float) 체결강도(%) 59일


''' ,

    'default': [
		'종목업종명', '일자', '1체결강도', '5체결강도', '20체결강도', '59체결강도', '현재가', '전일대비율','전일대비','거래량'
	]

}

