DESCRIPTION = {
	'summary': '복수 종목 일괄조회 7059',
	'point': '''
		StockMst 모듈이 하는 일을 복수종목에 한해서 수행한다. (최대,110종목)
		또 다른 점은 StockMst 모듈이 호출하는 type들에 비해 type이 제한적이다. 

	StockMst2.SetInputValue(0,value)
	->0(string), 종목 코드(구분자:',' , MAX: 110종목) 예) 

value = StockMst2.GetHeaderValue(type)

type 설명(StockMst에 없는 정보)

 18.외국인보유비율: StockMst없는 정보로 실제 매매로 인한 보유인지 확인 필요. 
            증감은 나름중요정보임.
 21.체결강도는 보통 (매수체결량 / 매도체결량) X 100 인데, 너무 올드한 방법임
   나름의 체결강도를 측정하는 것은 나름 중요한 시장정보라 오랫동안, 모든 시스템트레이딩
   집단이 각종 물리법칙을 동원해 심혈을 기울인 분야임.
   사이언스 테크놀러지는 HMM이론과 로켓사이언스로 이를 행했다고 알려짐. 
   과거에 스터디에서  이를 테스트해본 결과 2009년 임.
   당시로서는 이미 효율적이 되서 HMM 이나 로켓사이언스로는 시장에서 수익내기 어려웠음.    
   2010년경 국내 한 시스테머가 열역학을 이용한 체결강도로 큰 수익 내고 은퇴한다고 인증해서 인구에 회자됨. 

	'''
	'default': [
		'종목코드', '종목명', '전일대비', '현재가', '시가', '고가', '거래량','거래대금'
		, '외국인보유비율','체결강도'
	]

}