import win32com.client

from ..utils import *


DESCRIPTION = {
	'com_type': 'Request/Reply',
	'summary': '',
	'point': '''
	''',
	'defaults': [
		'종목코드', '시간', '현재가',
	]
}

MODULE_NAME = 'CpSysDib.MarketEye'

METHODS_INTERFACES = {

	'SetInputValue': {
		'field': {
			'position': 0,
			'type': ['long[]', 'long'],
			'essential': True,
			'options': 	{
					0: "종목코드",
					1: "시간",
					2: "대비부호",
					3: "전일대비",
					4: "현재가",
					5: "시가",
					6: "고가", # 필수 
					7: "저가",
					8: "매도호가",
					9: "매수호가",
					10: "거래량", # 필수 
					11: "거래대금",
					12: "장구분",
					13: "총매도호가잔량",
					14: "총매수호가잔량",
					15: "최우선매도호가잔량",
					16: "최우선매수호가잔량",
					17: "종목명",
					20: "총상장주식수",
					21: "외국인보유비율",
					22: "전일거래량",
					23: "전일종가",
					24: "체결강도",
					25: "체결구분",
					27: "미결제약정",
					28: "예상체결가",
					29: "예상체결가대비",
					30: "예상체결가대비부호",
					31: "예상체결수량",
					32: "19일종가합",
					33: "상한가",
					34: "하한가",
					35: "매매수량단위",
					36: "시간외단일대비부호",
					37: "시간외단일전일대비",
					38: "시간외단일현재가",
					39: "시간외단일시가",
					40: "시간외단일고가",
					41: "시간외단일저가",
					42: "시간외단일매도호가",
					43: "시간외단일매수호가",
					44: "시간외단일거래량",
					45: "시간외단일거래대금",
					46: "시간외단일총매도호가잔량",
					47: "시간외단일총매수호가잔량",
					48: "시간외단일최우선매도호가잔량",
					49: "시간외단일최우선매수호가잔량",
					50: "시간외단일체결강도",
					51: "시간외단일체결구분",
					53: "시간외단일예상/실체결구분",
					54: "시간외단일예상체결가",
					55: "시간외단일예상체결전일대비",
					56: "시간외단일예상체결대비부호",
					57: "시간외단일예상체결수량",
					59: "시간외단일기준가",
					60: "시간외단일상한가",
					61: "시간외단일하한가",
					62: "외국인순매매",
					63: "52주최고가",
					64: "52주최저가",
					65: "연중주최저가",
					66: "연중최저가",
					67: "PER",
					68: "시간외매수잔량",
					69: "시간외매도잔량",
					70: "EPS",
					71: "자본금",
					72: "액면가",
					73: "배당률",
					74: "배당수익률",
					75: "부채비율",
					76: "유보율",
					77: "자기자본이익률",
					78: "매출액증가율",
					79: "경상이익증가율",
					80: "순이익증가율",
					81: "투자심리",
					82: " VR",
					83: "5일 회전율",
					84: "4일 종가합",
					85: "9일 종가합",
					86: "매출액",
					87: "경상이익",
					88: "당기순이익",
					89: "BPS",
					90: "영업이익증가율",
					91: "영업이익",
					92: "매출액영업이익률",
					93: "매출액경상이익률",
					94: "이자보상비율",
					95: "결산년월",
					96: "분기BPS",
					97: "분기매출액증가율",
					98: "분기영업이액증가율",
					99: "분기경상이익증가율",
					100: "분기순이익증가율",
					101: "분기매출액",
					102: "분기영업이익",
					103: "분기경상이익",
					104: "분기당기순이익",
					105: "분개매출액영업이익률",
					106: "분기매출액경상이익률",
					107: "분기ROE",
					108: "분기이자보상비율",
					109: "분기유보율",
					110: "분기부채비율",
					111: "최근분기년월",
					112: "BASIS",
					113: "현지날짜",
					114: "국가명",
					115: "ELW이론가",
					116: "프로그램순매수",
					117: "당일외국인순매수잠정구분",
					118: "당일외국인순매수",
					119: "당일기관순매수잠정구분",
					120: "당일기관순매수",
					121: "전일외국인순매수",
					122: "전일기관순매수",
					123: "SPS",
					124: "CFPS",
					125: "EBITDA",
					126: "신용잔고율",
					127: "공매도수량",
					128: "공매도일자",
					129: "ELW e-기어링",
					130: "ELW LP보유양",
					131: "ELW LP보유율",
					132: "ELW LP Moneyness",
					133: "ELW LP Moneyness구분",
					134: "ELW 감마",
					135: "ELW 기어링",
					136: "ELW 내재변동성",
					137: "ELW 델타",
					138: "ELW 발행수량",
					139: "ELW 베가",
					140: "ELW 세타",
					141: "ELW 손익분기율",
					142: "ELW 역사적변동성",
					143: "ELW 자본지지점",
					144: "ELW 패리티",
					145: "ELW 프리미엄",
					146: "ELW 베리어",
				},
			'default': (4, 67, 70, 111),
		},
		'code': {
			'position': 1,
			'type': ['str[]', 'str'],
			'essential': True,
		},
		'contract': {
			'position': 2,
			'type': ['char'],
			'essential': False,
			'options': {
				ord('1'): '체결가비교방식',
				ord('2'): '호가비교방식,'
			},
			'default': ord('1'),
		},
	},
	'GetHeaderValue': {
		'type': {
			'position': 0,
			'type': ['long'],
			'essential': True,
			'options': {
				0: 'columns',
				1: 'fields',
				2: 'rows',
			}
		},
	},
	'GetDataValue': {
		'type': {
			'position': 0,
			'type': ['long'],
			'essential': True,
		},
		'index': {
			'position': 1,
			'type': ['long'],
			'essential': True,
		},
	},	
}


def get_marketeye(**kwargs):
	setinputvalue_argset = encode_args(METHODS_INTERFACES, 'SetInputValue', **kwargs)
	cp = win32com.client.Dispatch(MODULE_NAME)
	cp = set_inputvalue(cp, setinputvalue_argset)
	records =  output_to_records(METHODS_INTERFACES, cp, setinputvalue_argset)
	return records








