import win32com.client

from ..utils import *


DESCRIPTION = {
	'com_type': 'Request/Reply',
	'summary': '주식 지수 등의 여러 종목의 필요 항목 한번에 수신 7059',
	'point': '''
주식및 지수 등의 가장 포괄적인 정보를 제공하는 모듈  
  
통신종류 
	 Request/Reply
 

MarketEye.SetInputValue(type,value)
type: 입력 데이터 종류
0 - (long or long array) 필드 또는 필드 배열. 최대 64개의 필드까지 요청가능

필드값(시간외 정보, 예상체결 관련 정보, ElW관련 정보는 제외)

13.14 총매도수 호가잔량: 호가로서 매도누적잔량으로 큰 의미 없음
15.16:최우선매도/매수호가잔량: 매도1호가 매수1호가 잔량임  
20:총상장주식수 - 단위:주
21:외국인보유비율: 증감은 나름 중요정보
22:전일거래량
23:전일종가: 전일 대비 값 계산 위해 필요
24:체결강도: 기설명한 바 있음. 중요 정보지만, 
  매수체결 매도체결 정보를 따로 받아 변용해서 써야 함. 
25:체결구분 
'1'  매수체결 /'2' 매도체결
32:19일종가합: 20일값을 위한 값. 20이평은 중요함. (이평기간 최적화는 좋지 않음) 
33.34:상하한가,하한가: 상하한가 체크를 위해 필요.
35:매매수량단위: 주식 가격대별로 거래되는 수량단위
62:외국인순매매: 증감은 외국인 유입과 유출의 중요정보
63.64:52주최고가,52주최저가: 최근 대략 1년의 기간. 최근으로 1년정보값. 
67:PER: 주가수익비율로 중요정보
70:EPS: 주당순이익으로 중요정보
71:자본금
72:액면가
73:배당률: 배당 하는 회사라는 정보는 최근 몇년사이에 중요해진 정보임.
74:배당수익률
75:부채비율: 재무적 안정성 판단. 업종부채와 유보율과 비교해야 함.
          가령 시설산업이라면 부채가 높을 수밖에 없고, 유보율이 높다면 부채는 넘어갈수 있는문제.
76:유보율: 재무적 판단요소로. 높을수록 좋지만 성장모멘텀 없을수도..
77:자기자본이익률: 부채를 제외한 자본에 의한 수익의 정도판단.
78:매출액증가율: 성장회사인지 중요정보.
79:경상이익증가율: 중요정보. =총매출-매출원가-관리비-판매비+영업외 수익-영업외 비용
80:순이익증가율: 실제적 이익이 나는 회사인지 판단.
81:투자심리: 과열여부 정도는 판단해볼만..
82: VR 주가상승일의 주식 거래량/ 주가하락일의 거래량X100 중요하지 않음.
 거래량은 그 증감. 폭발적인 구간값 정도가 중요.
83:5일 회전율:거래량을 총발행주식으로 나눈 개념으로 활발한 거래보이는지 보여줌.
84:4일 종가합: 5일이평 구하기 위한 값.
85:9일 종가합:10일이평 구하기 위한 값으로 추정.
86:매출액(단위: 백만)
87:경상이익(단위:원)
88:당기순이익(단위:원) 절대량도 중요정보
89:BPS: 주당순자산으로 중요정보
90:영업이익증가율: 중요정보임
91:영업이익(단위:원)
92:매출액영업이익률: 매출액대비 영업이익률
93:매출액경상이익률: 매출액대비 경상이익률
94:이자보상비율: 이자보상비율 1이면 영업수익 이자지급. 
   1보다 클 경우 자체 수익으로 금융비용 부담가능. 
95:결산년월(yyymm)
96:분기BPS: 분기주당순자산. 자체로 중요정보이며. 증감도 증요.
97:분기매출액증가율: 사업영역의 전망 보여줌
98:분기영업이액증가율: 회사의 경쟁력 보여줌. 
99:분기경상이익증가율: 영업내외 이익까지 감안.
100:분기순이익증가율: 중요.
101:분기매출액(단위:원)
102:분기영업이익(단위:원)
103:분기경상이익(단위:원)
104:분기당기순이익(단위:원)
105:분기매출액영업이익률:ROA정보로 -0.4라면 100원팔면 40원손해.
106:분기매출액경상이익률
107:분기ROE(자기자본순이익률):ROE정보 ROA에 부채비율을 감안.
108:분기이자보상비율; 1기준 영업익이 이자 감당할수 있는 정도.
109:분기유보율: 영업이익을 현금으로 쌓아두는 정도.
110:분기부채비율
111:최근분기년월(yyyymm)
113:현지날짜(ulong) - yyyymmdd
114:국가명(string) - 해외지수 국가명
116:프로그램순매수: 프매수의 영향력 구분
117:당일외국인순매수잠정구분: 실시간이 아니고 하루 3-4회 잠정치 제공.
'  장이 종료되고 확정치를 제공. 
'0'(0) 해당없음/'1' 확정 / '2'  잠정
118:당일외국인순매수
119:당일기관순매수잠정구분
'0'(0) 해당없음/'1'  확정/'2' 잠정
120:당일기관순매수
121:전일외국인순매수
122:전일기관순매수
123:SPS: 주당매출액. 총매출/발행주식수. 
124:CFPS: 주당현금흐름.순이익보다 기업안정성 측면 은행권에서 중요하게봄.
125:EBITDA:감가상각 고려지 않은 영업이익으로.   EV/EBITDA 비율을 구하는 것이 적정
 EV = 시가총액 + 총부채 - 현금 및 현금성자산임. (총부채, 현금성자산 정보없음)
126:신용잔고율: 소위 빚내서 투자하는 개인참여비율 측정.
127:공매도수량: 누적공매도 수량은 중요정보임.
 과거 셅트리온처럼 아무리 상승 모덴텀이 있어도 공매도비중 높으면 상승여력 줆.
128:공매도일자

	''',
	'defaults': ['종목코드','시간', '대비부호','전일대비','현재가','시가', '고가', '고가', '저가', '매도호가','매수호가'
		,'거래량', '거래대금', '종목명', '외국인보유비율','전일종가', '체결강도','상한가','하한가','매매수량단위','외국인순매매','외국인보유비율'
	    ,'19일종가합','상한가','하한가','52주최고가','52주최저가','PER','EPS','배당률','배당수익률','부채비율','유보율','자기자본이익률'
	    ,'매출액증가율','순이익증가율','투자심리','5일회전율','4일종가합','당기순이익','BPS','영업이익증가율','영업이익','매출액영업이익율','분기순익증가율'
        ,'분기매출액', '분기영업이익', '분기당기순이익','분기매출액영업이익율','분기ROE','분기이자보상비율','분기유보율','분기부채비율','최근분기년월'
        ,'프로그램순매수','당일외국인순매수잠정구분','당일외국인순매수', '당일기관순매수잠정구분','당일기관순매수', '전일외국인순매수', '전일기관순매수'
        ,'CFPS','EV','EBITDA','신용잔고율', '공매도수량', '공매도일자', '공매도비중'

       ]

	}

MODULE_NAME = 'CpSysDib.MarketEye'

METHODS_INTERFACES = {

	'SetInputValue': {
		'field': {
			'position': 0,
			'type': ['long[]', 'long'],
			'essential': True,
			'options': 	{
					0: "종목코드",
					1: "시간",
					2: "대비부호",
					3: "전일대비",
					4: "현재가",
					5: "시가",
					6: "고가", # 필수 
					7: "저가",
					8: "매도호가",
					9: "매수호가",
					10: "거래량", # 필수 
					11: "거래대금",
					12: "장구분",
					13: "총매도호가잔량",
					14: "총매수호가잔량",
					15: "최우선매도호가잔량",
					16: "최우선매수호가잔량",
					17: "종목명",
					20: "총상장주식수",
					21: "외국인보유비율",
					22: "전일거래량",
					23: "전일종가",
					24: "체결강도",
					25: "체결구분",
					27: "미결제약정",
					28: "예상체결가",
					29: "예상체결가대비",
					30: "예상체결가대비부호",
					31: "예상체결수량",
					32: "19일종가합",
					33: "상한가",
					34: "하한가",
					35: "매매수량단위",
					36: "시간외단일대비부호",
					37: "시간외단일전일대비",
					38: "시간외단일현재가",
					39: "시간외단일시가",
					40: "시간외단일고가",
					41: "시간외단일저가",
					42: "시간외단일매도호가",
					43: "시간외단일매수호가",
					44: "시간외단일거래량",
					45: "시간외단일거래대금",
					46: "시간외단일총매도호가잔량",
					47: "시간외단일총매수호가잔량",
					48: "시간외단일최우선매도호가잔량",
					49: "시간외단일최우선매수호가잔량",
					50: "시간외단일체결강도",
					51: "시간외단일체결구분",
					53: "시간외단일예상/실체결구분",
					54: "시간외단일예상체결가",
					55: "시간외단일예상체결전일대비",
					56: "시간외단일예상체결대비부호",
					57: "시간외단일예상체결수량",
					59: "시간외단일기준가",
					60: "시간외단일상한가",
					61: "시간외단일하한가",
					62: "외국인순매매",
					63: "52주최고가",
					64: "52주최저가",
					65: "연중주최저가",
					66: "연중최저가",
					67: "PER",
					68: "시간외매수잔량",
					69: "시간외매도잔량",
					70: "EPS",
					71: "자본금",
					72: "액면가",
					73: "배당률",
					74: "배당수익률",
					75: "부채비율",
					76: "유보율",
					77: "자기자본이익률",
					78: "매출액증가율",
					79: "경상이익증가율",
					80: "순이익증가율",
					81: "투자심리",
					82: " VR",
					83: "5일 회전율",
					84: "4일 종가합",
					85: "9일 종가합",
					86: "매출액",
					87: "경상이익",
					88: "당기순이익",
					89: "BPS",
					90: "영업이익증가율",
					91: "영업이익",
					92: "매출액영업이익률",
					93: "매출액경상이익률",
					94: "이자보상비율",
					95: "결산년월",
					96: "분기BPS",
					97: "분기매출액증가율",
					98: "분기영업이액증가율",
					99: "분기경상이익증가율",
					100: "분기순이익증가율",
					101: "분기매출액",
					102: "분기영업이익",
					103: "분기경상이익",
					104: "분기당기순이익",
					105: "분개매출액영업이익률",
					106: "분기매출액경상이익률",
					107: "분기ROE",
					108: "분기이자보상비율",
					109: "분기유보율",
					110: "분기부채비율",
					111: "최근분기년월",
					112: "BASIS",
					113: "현지날짜",
					114: "국가명",
					115: "ELW이론가",
					116: "프로그램순매수",
					117: "당일외국인순매수잠정구분",
					118: "당일외국인순매수",
					119: "당일기관순매수잠정구분",
					120: "당일기관순매수",
					121: "전일외국인순매수",
					122: "전일기관순매수",
					123: "SPS",
					124: "CFPS",
					125: "EBITDA",
					126: "신용잔고율",
					127: "공매도수량",
					128: "공매도일자",
					129: "ELW e-기어링",
					130: "ELW LP보유양",
					131: "ELW LP보유율",
					132: "ELW LP Moneyness",
					133: "ELW LP Moneyness구분",
					134: "ELW 감마",
					135: "ELW 기어링",
					136: "ELW 내재변동성",
					137: "ELW 델타",
					138: "ELW 발행수량",
					139: "ELW 베가",
					140: "ELW 세타",
					141: "ELW 손익분기율",
					142: "ELW 역사적변동성",
					143: "ELW 자본지지점",
					144: "ELW 패리티",
					145: "ELW 프리미엄",
					146: "ELW 베리어",
				},
			'default': (4, 67, 70, 111),
		},
		'code': {
			'position': 1,
			'type': ['str[]', 'str'],
			'essential': True,
		},
		'contract': {
			'position': 2,
			'type': ['char'],
			'essential': False,
			'options': {
				ord('1'): '체결가비교방식',
				ord('2'): '호가비교방식,'
			},
			'default': ord('1'),
		},
	},
	'GetHeaderValue': {
		'type': {
			'position': 0,
			'type': ['long'],
			'essential': True,
			'options': {
				0: 'columns',
				1: 'fields',
				2: 'rows',
			}
		},
	},
	'GetDataValue': {
		'type': {
			'position': 0,
			'type': ['long'],
			'essential': True,
		},
		'index': {
			'position': 1,
			'type': ['long'],
			'essential': True,
		},
	},	
}


def get_marketeye(**kwargs):
	setinputvalue_argset = encode_args(METHODS_INTERFACES, 'SetInputValue', **kwargs)
	cp = win32com.client.Dispatch(MODULE_NAME)
	cp = set_inputvalue(cp, setinputvalue_argset)
	records =  output_to_records(METHODS_INTERFACES, cp, setinputvalue_argset)
	return records








